{
  "title": "Over mij",
  "description": [
    "Hoi, ik ben <strong>Sem Plaatsman</strong>, een vierdejaars Bachelor-student Informatica aan de Hogeschool Inholland in Haarlem. Ik heb een passie voor het <strong>oplossen van problemen</strong> en duik graag diep in complexe vraagstukken. Ik ben altijd bereid om <strong>nieuwe dingen te leren</strong> en mijn vaardigheden te verbeteren.",
    "Ik heb ervaring met verschillende programmeertalen en technologieën, zoals Java, C#, TypeScript, Python en (No)SQL. Ook ben ik bekend met frameworks en libraries zoals React, Spring Boot, ASP.NET en TensorFlow. Momenteel ben ik bezig met het uitbreiden van mijn kennis van <strong>CI/CD en Cloud Computing</strong>."
  ],
  "whatImDoing": {
    "title": "Wat ik doe",
    "interests": {
      "backendDevelopment": {
        "title": "Backend Development",
        "description": "Het bouwen van backend-systemen en API's voor verschillende toepassingen",
        "iconAlt": "Backend Development icoon"
      },
      "webDevelopment": {
        "title": "Web Development",
        "description": "Ontwikkelen van functionele websites gebouwd met moderne technologieën.",
        "iconAlt": "Web Development icoon"
      },
      "artificialIntelligence": {
        "title": "Artificial Intelligence",
        "description": "Het ontwikkelen van zowel machine als deep learning AI-modellen.",
        "iconAlt": "Artificial Intelligence icoon"
      },
      "cooking": {
        "title": "Koken",
        "description": "Naast programmeren houd ik van koken en het uitproberen van nieuwe recepten.",
        "iconAlt": "Koken icoon"
      }
    }
  },
  "testimonials": {
    "title": "Referenties",
    "testimonials": {
      "marcDierikx": {
        "name": "Marc Dierikx",
        "position": "Technisch Directeur bij S.P. Abonneeservice BV",
        "dateISO": "2024-09-03",
        "text": "TBA",
        "avatarAlt": "Marc Dierikx avatar"
      },
      "tayamElJebari": {
        "name": "Tayam El Jebari",
        "position": "Medestudent | DevOps Engineer bij Albert Heijn",
        "dateISO": "2023-09-04",
        "text": "Ik heb de samenwerking met Sem als prettig ervaren. Sem heeft een goed vermogen om initiatief te nemen bij diverse taken en heeft een serieuze aanpak met zijn verantwoordelijkheden. Zijn communicatievaardigheden zijn uitstekend, wat de samenwerking binnen het team altijd soepel laat verlopen. Zijn dedicatie en ijverigheid leidt altijd tot een heldere structuur in zijn code. Sem is ook een opgewekte en leuke collega om mee samen te werken. Zijn positieve instelling draagt bij aan een prettige werksfeer.",
        "avatarAlt": "Tayam El Jebari avatar"
      }
    }
  }
}
