{
  "title": "About me",
  "description": [
    "Hey, I'm <strong>{{config.owner.fullName}}</strong>, a fourth-year Bachelor's student of Computer Science at Inholland University of Applied Sciences in Haarlem, The Netherlands. I have a passion for <strong>problem solving</strong> and like to dive deep into complex issues. I'm always eager to <strong>learn new things</strong> and improve my skills.",
    "I have experience with various programming languages and technologies, such as Java, C#, TypeScript, Python, and (No)SQL. I'm also familiar with frameworks and libraries like React, Spring Boot, ASP.NET, and TensorFlow. I'm currently working on expanding my knowledge of <strong>CI/CD and Cloud Computing</strong>."
  ],
  "whatImDoing": {
    "title": "What I'm Doing",
    "interests": {
      "backendDevelopment": {
        "title": "Backend Development",
        "description": "Building backend systems and API's for various applications",
        "iconAlt": "Backend Development icon"
      },
      "webDevelopment": {
        "title": "Web Development",
        "description": "Developing functional websites built with modern technologies.",
        "iconAlt": "Web Development icon"
      },
      "artificialIntelligence": {
        "title": "Artificial Intelligence",
        "description": "Creating both machine and deep learning AI models.",
        "iconAlt": "Artificial Intelligence icon"
      },
      "cooking": {
        "title": "Cooking",
        "description": "Besides programming, I love to cook and try new recipes.",
        "iconAlt": "Cooking icon"
      }
    }
  },
  "testimonials": {
    "title": "Testimonials",
    "testimonials": {
      "marcDierikx": {
        "name": "Marc Dierikx",
        "position": "Chief Technology Officer at S.P. Abonneeservice BV",
        "dateISO": "2024-09-11",
        "description": [
          "Sem joined us as an intern on a project where he could work as a full stack developer.",
          "He turned out to be a very nice and incredibly driven and motivated student who needed to be slowed down rather than stimulated.",
          "He is good at turning functional ideas into technical designs, mock-ups and proof-of-concept setups.",
          "He is also very good at putting himself in the shoes of the end users of the software. This not only creates a technically well-functioning system, but also a system with a pleasant user interface.",
          "In addition, during a project there are always unforeseen situations that are more difficult to solve. Sem is someone who in such a situation certainly does not give up, but instead looks for alternatives.",
          "All in all a very good addition to our IT department."
        ],
        "avatarAlt": "Marc Dierikx avatar"
      },
      "tayamElJebari": {
        "name": "Tayam El Jebari",
        "position": "Fellow student | DevOps Engineer bij Albert Heijn",
        "dateISO": "2024-09-04",
        "description": [
          "I have enjoyed working with Sem. Sem has a good ability to take initiative in various tasks and has a serious approach with his responsibilities.",
          "His communication skills are excellent, which always makes cooperation within the team run smoothly. His dedication and diligence always leads to a clear structure in his code. Sem is also an upbeat and fun colleague to work with. His positive attitude contributes to a pleasant working atmosphere."
        ],
        "avatarAlt": "Tayam El Jebari avatar"
      }
    }
  }
}
