{
  "overview": {
    "title": "Project Overview",
    "description": [
      "<strong>semplaatsman.nl</strong> is a <strong>modern, fully responsive personal portfolio website</strong> built with <strong>React</strong>. This project showcases advanced web development techniques and serves as an ideal template for developers creating their online presence.",
      "The website features a <strong>component-based architecture</strong> ensuring code reusability and maintainability, with <strong>TypeScript</strong> adding an extra layer of type safety. Key features include <strong>multiple themes</strong> (light and dark modes), <strong>built-in multilingual support</strong>, and integration with various web services for optimal performance and functionality."
    ]
  },
  "technicalImplementation": {
    "title": "Technical Implementation",
    "description": "The project leverages several modern web technologies:",
    "items": [
      "<strong>React</strong>: For building a dynamic and efficient user interface",
      "<strong>TypeScript</strong>: Enhances code quality with static typing",
      "<strong>Vite</strong>: Provides a fast and lean development experience",
      "<strong>SCSS</strong>: Enables advanced styling capabilities",
      "<strong>react-i18next</strong>: Implements multilingual support",
      "<strong>React Router</strong>: Manages navigation and routing",
      "<strong>React Helmet</strong>: Handles dynamic document head management",
      "<strong>GitHub Pages</strong>: Offers free and reliable hosting",
      "<strong>Cloudflare</strong>: Provides CDN and DNS management for improved performance",
      "<strong>EmailJS</strong> and <strong>Mailgun</strong>: Enable secure email functionality with address obfuscation"
    ]
  },
  "developmentJourney": {
    "title": "Development Journey",
    "description": "The project evolved from a static HTML/CSS/JS template to a dynamic React application. This transformation involved breaking down the HTML structure into reusable components, converting CSS to SCSS modules, and integrating JavaScript functionality into React TypeScript components.",
    "steps": [
      "Implementing multi-theme support",
      "Setting up internationalization",
      "Creating a CI/CD pipeline with GitHub Actions",
      "Integrating email functionality"
    ]
  },
  "openSourceContribution": {
    "title": "Open-Source Contribution",
    "description": "As an open-source project, semplaatsman.nl serves as a learning resource for other developers. The well-documented codebase, contribution guidelines, and extensive wiki documentation make it easy for others to use, customize, and learn from."
  },
  "impact": {
    "title": "Impact and Future Perspective",
    "description": "This project represents significant growth in professional software development skills, DevOps practices, and technical insights. It demonstrates the potential for creating high-quality, performant web applications using modern technologies and best practices, while also contributing to the open-source community."
  }
}
